# Git - распределенная система контроля версий.
# это система для отслеживания и ведения истрории изменения файлом , в вашем проекте 

# Репозиторий - хранилище вашего кода и его изменений 

# GitHub - веб сайт для размешения  
# git - репозиторий и совместной разработки проектов.


# 1. git init - она создает новый гит репозиторий локальный на вашем пк 

# 2. git commit -  как только мы достигаем опреленного момента в разработк то тогда мы 
# мы сохраняем  и комментируем изменения (фиксация изменений )