# Git - распределенная система контроля версий.
# это система для отслеживания и ведения истрории изменения файлом , в вашем проекте 

# Репозиторий - хранилище вашего кода и его изменений 

# GitHub - веб сайт для размешения  
# git - репозиторий и совместной разработки проектов.


# 1. git init - она создает новый гит репозиторий локальный на вашем пк 

# 2. git commit -  как только мы достигаем опреленного момента в разработк то тогда мы 
# мы сохраняем  и комментируем изменения (фиксация изменений в репо историй)

# 3. git add - когда мы создаем или измняем файлы,
# то при помощи этой команды мы закружаем все изменения в локальной хранилизеще

# git add <названия файла>
# git add .

# 4. git remote add - это команда для того чтобы связать ваш проект с удаленным репозиторием (репо в гитхабе)

# git remote add <название подключения> <ссылка на репо>

# git remote add origin <url>

# 5. git push - после коммита изменений при помощи этой команды мы отправляеим наши 
# изменения на удаленный репозиторий

# git push <название ветки>

#--------------------------------

# 6. git branch.  Ветки очень важны в git 
# При помощи веток несколько программистов могут работать параллельно на одном и том же
# проекте. При помоши команды git branch  мы можем создавать, просматривать илм удалять ветки

# Создание ветки; git branch <Название ветки>
# просмотр ветки: git branch or git branch --list

# удаление ветки: git branch -d <название ветки>

#7 . git checkout - команда изспользуется для работы в команде она помогает переключаться по веткам

# git checkout <название ветки>


строчка ветки tariel 
